Revit 2027 API
Point Methods
The Point type exposes the following members.
Methods
Name | Description
Create(XYZ) |  Creates a point at the given coordinates.
Create(XYZ, ElementId) |  Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals |  Determines whether the specified Object is equal to the current Object.
(Inherited from GeometryObject)
GetHashCode |  Gets the integer value of the geometry object as hash code
(Inherited from GeometryObject)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Point Class
Autodesk.Revit.DB Namespace